{
    "ce613faa-49e9-472d-897f-9d4e43cc18c7": {
        "status": "processing",
        "type": "file",
        "title": "Lewis-01.mp3",
        "date": "2026-02-12 10:37:49",
        "language": "hi"
    },
    "3815020d-5dcd-4d92-bed7-7c1233f03833": {
        "status": "processing",
        "type": "file",
        "title": "Lewis-01.mp3",
        "date": "2026-02-12 10:39:37",
        "language": "hi"
    },
    "3652026e-aa16-4253-ab9f-051770bc8ed7": {
        "status": "failed",
        "type": "file",
        "title": "Lewis-01.mp3",
        "date": "2026-02-12 11:33:36",
        "language": "hi",
        "error": "index out of range in self"
    },
    "0fee8308-e430-4e12-b9bf-4cf30672a80f": {
        "status": "failed",
        "type": "file",
        "title": "Lewis-01.mp3",
        "date": "2026-02-12 11:43:53",
        "language": "en",
        "error": "index out of range in self"
    },
    "4ebba0a2-fdc9-4924-ab93-ffe7c0605ae3": {
        "status": "completed",
        "type": "file",
        "title": "Lewis-01.mp3",
        "date": "2026-02-12 11:58:35",
        "language": "es",
        "result": {
            "transcript": "libros grabados se complace en presentar la serie de estudiosos modernos, donde los grandes profesores le enseñan. Mi nombre es Jack Garrett, y voy a ser su anfitrión. Hoy comenzamos un curso titulado La literatura de CS Lewis. Su profesor es Timothy Schutt de la Universidad de Kenia. El profesor Schutt obtuvo su licenciatura en literatura inglesa en Yale, y su doctorado en literatura medieval y la historia de las ideas en la Universidad de Virginia. Desde 1986, el profesor Schutt ha enseñado en el Colegio de Kenia en el Departamento de Inglés, y en el programa integrado único de la universidad en estudios humanos, un programa interdisciplinario que se centra en los grandes libros de literatura, filosofía, historia, historia del arte, religión y ciencia. Además de numerosas publicaciones académicas, Schutt también ha escrito extensamente sobre historia militar, béisbol y aves. La mayoría de la gente está familiarizada con el nombre de CS Lewis, de su querida serie de libros infantiles, Las Crónicas de Narnia. La tierra de Narnia ha fascinado a generaciones de lectores que siguieron los viajes de niños y niñas atraídos desde la Tierra a otro lugar mundano de animales que hablan y alta aventura. Pero para todas sus historias convincentes, las Crónicas son también obras alegóricas que exploran las complicadas luchas espirituales de la fe. Lewis, un veterano de la Gran Guerra, medievalista académico, apologista cristiano, y autor popular. escribió las Crónicas con las mismas intenciones serias que trajo a todo su trabajo. Sin ser predicado o dominante, Lewis quería compartir con el lector su visión privada de la vida y la fe, que se centró en una devoción a la alegría. Lewis tituló la autobiografía de sus primeros años, sorprendido por la alegría. Y es este sentimiento de alegría y bienestar repentino que él creía que era la gran afirmación y validación de la vida. En este curso, vamos a explorar la tierra de Narnia, así como la ficción menos conocida de Lewis, y sus obras apologéticas respetadas. A medida que examinamos la historia del hombre que escribió una vez, la alegría es el asunto serio del cielo. Y lo hizo el asunto serio de su vida. Para más información sobre este curso, por favor visite su página web en www.modernscalalor.com donde tendrá acceso a enlaces a sitios relacionados, una sala de seminarios para mostrar sus pensamientos con otros estudiantes. Y sí, por supuesto, un examen final. Y ahora comenzamos la literatura de CS Lewis, la primera conferencia, CS Lewis, la reputación y la influencia, y ahora, profesor Shud, bienvenido a nuestro curso sobre las obras de CS Lewis. Nos centraremos en gran medida en estas obras de ficción, pero tendremos la oportunidad de echar un vistazo a algunas de sus obras de disculpa, y de hecho incluso un poco de discusión, no demasiado, pero un poco de sus obras de estudioso también. Él va a empezar con, como usted sabe sin sentido, un autor muy admirado y bien amado, los que gustan de las obras de CS Lewis tienden a gustar mucho, y le gusta mucho, y para muchos lectores ven, ocupa una especie de lugar especial. Desde su muerte en 1963, curiosamente, su creciente progresivamente más popular y más influyente, y sus libros venden mejor ahora de lo que nunca han hecho. Y se venden muy bien de hecho, y hay un montón de ellos. A lo largo de su vida, una vez que llegó a su paso, realmente se puso a ir después de que tenía treinta años. Escribió, bien más de 40 libros, y va a echar un vistazo a muchos de ellos. A pesar de su popularidad, sin embargo, y a pesar del afecto que genera en muchos lectores, es, en otros contextos, un escritor controvertido. Él no es para el gusto de todos y para muchos lectores y para muchos que no han leído CS Lewis, sin duda, es sospechoso. Describe una escena en realidad en la última batalla. La última de las Crónicas de Narnium, probablemente sus obras más famosas, donde todos los seres conscientes en Narnium humanos enanos, granjas en toda la panoplia de criaturas de Narnium son convocados a la cara de Aslan, el gran león. Y cuando vienen a Aslan, uno tras otro, o miran en su cara con regocijo. Esto es lo que siempre he querido. O se apartan con miedo, incomodidad y disgusto. Lewis mismo y sus obras evocan un tipo similar de reacción a la gente como él sabrá. La gente tiende a gustarle mucho y encuentra que sus obras los llevan a algún lugar o los satisfacen alguna necesidad profunda o los encuentran opresivos y repelidos. Y la razón, de nuevo, es muy la misma. Su talento central, yo diría, fuera de su pura habilidad como escritor y oficio verbal en legibilidad, que es muy, muy bueno, excelente. Su mayor habilidad es la capacidad de evocar lo que él llama alegría. Y antes de ir más lejos, ya que esta alegría, lo que él llama alegría es una nota clave a lo largo de todas sus obras de ficción, y de hecho a través de sus obras apologéticas también, quiero hablar un poco sobre lo que eso es y lo que eso significa para él. Entonces, ¿cuál es esta alegría que para Lewis es la cosa más importante en la vida, y es la clave de hecho de todas sus obras de ficción y en algún sentido de todas sus obras de disculpa también. Nos dice que al principio se le acercó, cuando era un niño muy pequeño, su hermano hizo en lo que él llama una galleta para él, es decir galletas en Inglaterra son galletas, lo que nosotros llamaríamos galletas en América. Es una pequeña tapa de metal. Su hermano hizo un jardín de juguetes y Lewis miró el jardín y sintió barrer sobre él una especie de anhelo. Más tarde describe que dice, entonces esto le recordó a esa lata de galleta, se paró junto a un arbusto floreciente actual y la alegría se extendió sobre él. En su autobiografía es difícil encontrar palabras lo suficientemente fuertes para la sensación, un anhelo gozoso o un deseo de que él no supiera lo que era tan insatisfecho como era. Incumplido como llegó a creer que debía ser, era en sí más deseable que cualquier otra satisfacción. Dudo que Lewis diga que cualquiera que lo haya probado alguna vez lo intercambiaría por todos los placeres del mundo. Luego, leyendo en una obra de Henry Wadsworth Longfellow, el poeta estadounidense que trabajaba desde las sagas nórdicas o islandesas, leyó el siguiente pasaje y simplemente lo atravesó. Aquí está el pasaje. Oí una voz que lloraba, más calva, la hermosa está muerta, está muerta. Lewis dice, Yo no sabía nada acerca de calvo, los dioses nórdicos asesinados por el embaucador Loki, pero instantáneamente fui elevado a enormes regiones del cielo norteño. Yo deseaba con intensidad casi enfermiza, algo que nunca se describiría, excepto que es frío, espacioso, severo, pálido y remoto. Entonces me encontré en el mismo momento que ya caía fuera de ese deseo y deseaba estar de vuelta en él. En los pies de Dante en la Wolva, y Dante era uno de los autores favoritos de Lewis, tal vez sus autores favoritos simplemente. Dante nos dice que cuando tenía nueve años de edad, él estaba caminando por una calle en Florencia, y vio vestido con el color más noble, una hermosa carmesí, una mujer joven, de belleza y gracia completamente trascendente. Y en ese momento, dice Dante, mi nueva vida comenzó, mi Veda Nuova, y yo fui cambiado dentro. En ese momento, me sentí ennoblecido, sentí que sería imposible para mí hacer algo indigno. Me transformó y Dante persigue esa visión en su obra, hasta el final de los últimos años, la comedia divina a la presencia misma de Dios mismo. El nombre de la joven en la vida real era mejor cada día, importante no una Beatrice, portadora de bendiciones, como su nombre significa, y ese sentimiento que ella evoca en Dante transforma su vida, lo convierte, le informa una estrella de carga para el resto de su vida. Eso es lo que la alegría es vernos Lewis. Él lo utiliza, y él es bastante explícito sobre esto como un término técnico. Dice alegre que lo define, es la más dulce y la mejor de todas las sensaciones, pero es una especie de anhelo, casi una especie de dolor. No es la felicidad como se concibe habitualmente. Ni es la alegría, ni es la jalea, ni es un buen humor. Es una especie de dolor insatisfactorio para un más allá que está allí y no está allí, que para Lewis fue asaltado por el cielo del norte, por la visión de amplio, brillante, espacio vacío. Hasta cierto punto, en sorpresa por la alegría, su autobiografía, es una cita de un hijo de William Wordsworth. Fue sorprendido por la presencia de la alegría en su vida, y la importancia de la alegría en su vida. Hasta cierto punto en ese trabajo, Lewis está siendo un poco tímido con nosotros. Él sabe perfectamente bien lo que es la alegría. Más tarde, él no afirmó, y yo le creo, él no lo hizo cuando era un niño. No lo hizo cuando se enteró de que Bell a la hermosa era Tab estaba muerto. No lo hizo cuando vio el jardín de juguetes de su hermano en la lata de galletas, pero lo hizo más tarde. Y lo que es la alegría, para Lewis, finalmente, darle un nombre planar, es la experiencia religiosa. Es la presencia sentida de Dios. La alegría para Lewis es lo que se siente la experiencia religiosa. No directamente un placer, pero este sentido guía de anhelo y presencia, este dolor. Y es su creencia, profundamente sostenida, que al seguir la alegría, al igual que Dante al seguir a Beatrice, la alegría es Beatrice, la alegría para Lewis es un portador de bendiciones. Alegría para Lewis es, en efecto, revelación para usted, al seguir que usted será llevado a cumplir su destino. Es decir, su creencia profundamente sostenida en su propia vida. Y así él espera en la vida de aquellos que leen sus libros. Y él sabe perfectamente bien. Además, la alegría en este sentido no se puede explicar. Sin embargo, menos se puede argumentar. No se puede discutir a alguien en ella. Sólo se puede evocar o llamar. Es por eso que usted tiene que ser sorprendido por la alegría. Es algo que viene sobre usted. No es algo a lo que usted llega, como Lewis mismo dice en un momento, usted puede construir un altar para que el fuego venga a otro lugar. No está exactamente dentro de nuestro poder o ámbito, puedes llamarlo, pero no puedes explicar a alguien en él. La alegría es también ponerlo en otro sentido para Lewis, la puerta al otro mundo. Y Lewis es sobre todo el poeta, por así decirlo, del otro mundo. Bueno, se puede ver no sólo allí, creo. También se revela a diversos grados extensos para Lewis al menos en sueños, en visión, en imaginación, en mito y en historia. Y los de Lewis son otro mundo, no en el sentido de ser una fabricación, compuesto, alusión, imaginario, alternativa a nuestro mundo. Pero el otro mundo es una forma de conocer el mundo real, el mundo que de hecho vivimos en este mundo. Para Lewis, en una especie de riqueza, profundidad, complejidad y plenitud que no podemos conocer por medio del trabajo ordinario un día, tiempo para ir a trabajar, tiempo para comer, conciencia. Paradójicamente, para Lewis, sabemos más sobre dónde estamos, quiénes somos y lo que somos por medio del otro mundo que por medio de lo que normalmente pensamos como este mundo. Por eso creo que esa convicción es la razón por la que se convirtió en un devolista y centró su atención profesionalmente en el Renacimiento medieval y la literatura clásica. Porque los escritores de toda la literatura medieval clásica y renacentista creían en el otro mundo, si eran paganos, si eran cristianos, si eran escépticos, incluso, en todos los casos, el otro mundo como fuente de significado, como fuente de conocimiento, como un reino que de alguna manera profundo informó y orientó este mundo, para todas esas personas, que era un hecho. Y así, en un sentido fundamental, Lewis compartió una visión del mundo y orientación con estas figuras clásicas medievales y renacentistas que no compartió con figuras que escribió en tiempos más recientes. Dante, el poeta Gawain que va al castillo de Sabrina Salacca que va en Burrell a una visión del cielo, esas personas eran sus parientes espirituales y así también como nos dice, algunos de sus contemporáneos, George McDonald, a mí casi ilegible, escritor de cuentos de hadas escoceses, que por lo que Lewis dice bautizó su imaginación en una estación de tren un día en 1916 cuando recogió el libro Fantasticas, así que para Beatrix Potter, no sé muchas personas que dicen haber tenido su vida cambiada por ardilla nuckkin, pero Lewis era uno. Dice que en ella se enamoró de la idea del otoño y fue la fuente de alegría para él. Otro amigo personal, Charles Williams, un escritor de más para mí bastante ilegibles novelas y por supuesto J. R. R. Tolkien, escritor de novelas que eran muy legibles de hecho, todos ellos creían en el otro mundo, dependían del otro mundo. Vale, ¿y qué pasa con estas otras cosas del mundo? Ahora para Lewis, claramente tiene una dimensión religiosa, principalmente una dimensión religiosa, y de hecho en el caso de Lewis una dimensión explícitamente cristiana, pero yo diría que no es necesario ser religioso o cristiano para ver al menos parte de lo que Lewis significa por ese otro mundo e indirectamente entonces por alegría porque la conciencia, pensar en esto, esto es realmente cierto. La conciencia actúa como una especie de filtro. Somos conscientes cuando somos plenamente conscientes y autoconscientes de sólo una pequeña parte de lo que viene a nosotros, ¿verdad? Hay texturas y fluctuaciones a medida que el viento sopla sobre la hierba en la superficie de un lago en el conjunto de hojas fuera de nosotros en los patrones en la alfombra en el suelo, en todas partes, sonidos, sitios a los que simplemente no prestamos atención y de hecho la conciencia está diseñada para filtrarse para que podamos prestar atención a lo que es importante para nosotros saber. Estamos seleccionando y estrechando conscientemente nuestra experiencia sensorial. Eso es sólo eso. Y no sólo eso, hay dentro de nosotros todo tipo de programas neurológicos cableados para clasificar y organizar la experiencia que operan casi completamente inconscientemente. Y luego pensar en la memoria todo tipo de cosas que no son conscientes de en un momento dado que puede descansar fuera de la conciencia durante años y de repente se presentan en plena riqueza y panoplia. Todo este conjunto de experiencias desatendidas desatendidos a la memoria de no atendidos al procesamiento de no atendidos a recombinaciones y potenciales de recombinación se encuentra cerca de nosotros en la conciencia ordinaria para despertar sólo en sueños, visiones, lo suficientemente interesante y yo argumentaría en momentos de perspicacia y pensamiento creativo cuando forjamos conexiones que son nuevas para nosotros cuando las conexiones burbujas en nuestra conciencia desde abajo o más allá o fuera que no estaban allí antes en la historia y la imaginación disfrutar de sí mismo en la experiencia religiosa. Sabemos en ese sentido y Lewis sabía que sabemos y que suena paradójico que sabemos más de lo que sabemos. Sabemos mucho más de lo que sabemos porque nuestra conciencia ordinaria de nuevo es estrecha. Pero, de hecho, enormes recursos están abiertos a nosotros que son accesibles en otros tiempos y en otros lugares y de hecho estos otros recursos son realmente la realidad que condiciones donde vivimos y es mucho más rico, mucho más rico que donde nos encontramos normalmente. Una de las frases principales de Lewis que repite y varios contextos es que el interior es más grande que el exterior y no hay ningún lugar del cual eso sea más obviamente cierto que tu cabeza, que es del tamaño de un melón y lo que es del tamaño de un melón en este goo bioquímico que está ahí en el universo todo lo que ha sido siempre todo lo que será todo lo que sabes todo lo que has visto. Usted va dentro de este pequeño lugar ni siquiera un pie cúbico todo lo que es una metáfora en un sentido que se puede pensar para Lewis de las puertas en el otro mundo. Bueno, está bien así que lo que nada de esto particularmente importaría mucho si Lewis no eran diferentes a algunas de las personas que admira y escritor inmensamente dotado. Incluso más que su capacidad de narrar la alegría lo que es increíble de CS Lewis es que es tan fenomenalmente legible y en todas sus obras por cierto y sus obras de todo tipo que sólo tiene el toque de oro que escribe con una facilidad fluidez y transparencia que le hace si te gusta o no, si usted no está de acuerdo con él o no es un verdadero placer de leer. Vamos a centrarnos en las conferencias para seguir principalmente en sus obras de ficción y esas son en primera instancia las tres obras de su trilogía espacial fuera del planeta silencioso, paralelo y esa fuerza horrible entonces las siete crónicas de Narnia y finalmente el trabajo que escribió hacia el final de su vida hasta que tenemos caras que no es tanto leído como los otros pero es muy interesante. No voy a hablar más de esas obras de ficción ahora en lugar de hablar un poco sobre algunas de sus otras obras porque de hecho su vida literaria, académica y religiosa resultó en tres tipos diferentes de obras y escribió muchas de ellas. Tan popular en términos de ventas como sus obras de ficción, donde sus obras de apologética cristiana y yo debemos explicar en este contexto que la apologética no significa disculpas. La apologética significa algo más como teología popular que significa teología dirigida a la gente común o explicaciones. Y lo original de Lewis realmente vino más de sus obras de apologética que de cualquier otra cosa. De hecho, su libro más vendido es el mero cristianismo, que es la versión escrita de una serie de conferencias que fue invitado a dar en el aire durante la Segunda Guerra Mundial en 1942, de hecho por la British Broadcasting Company, BBC, el mero cristianismo, el cristianismo ordinario, los huesos desnudos de la creencia cristiana y que es inmensamente popular, especialmente entre los diversos rayos de los lectores Lewis. Las diversas poblaciones hacen a quienes sus obras apelan. el mero cristianismo es especialmente amado por los cristianos conservadores. Es un pilar en las listas de lectura para las personas en ese grupo. Lo ha hecho y lo muestra hasta cierto punto también en sus obras de ficción, no sólo un regalo para evocar la alegría, sino también un regalo para temer la auto-indulgencia y el autoengaño, por formas en que tratamos de persuadirnos a nosotros mismos de que estamos viviendo a la altura de nuestros ideales cuando realmente no lo estamos. Leer los libros de Lewis de la apologética cristiana y esto es una de las cosas que sus lectores cristianos conservadores, sus lectores anglicanos, valoran profundamente y por supuesto la mente de un lector secular de la unión, leer una de las obras de Lewis de la apologética cristiana es muy parecido a tener un examen sistemático de conciencia. No es como tener a alguien meneando el dedo hacia ti y decir, malo, malo, malo, malo, malo, malo, es más como tener una pequeña voz dentro de ti diciendo, bueno, me temo, sí, él se mete dentro de tu cabeza y confronta las formas en las que construyes ficción para ti mismo para prevenirte. Una vez más, los lectores cristianos realmente adoran eso. La obra que realmente lo hizo famoso, sin embargo, también fue en 1942. Esa fue su Anas Moravillus. Eran las cartas atornilladas. Las cartas atornilladas fueron publicadas por primera vez en el Manchester Guardian una tras otra y más tarde recogidas en forma de libro y pretenden ser las cartas de un demonio administrativo mayor a un demonio menor sobre cómo ir a tentar a un joven inglés durante la Segunda Guerra Mundial lejos de la creencia religiosa, lejos del cristianismo y en el campo del diablo. Y son ingeniosos, astutos, y fueron para sorpresa de todos un gran éxito y realmente hicieron el nombre de Louis. Él continuó escribiendo muchas, muchas, muchas otras obras apologéticas, el problema del dolor, milagros, y así sucesivamente, y todos estos continuaron ganando hasta el día de hoy, un lector muy, muy grande. De hecho, ha crecido para ser una especie de contienda entre dos escuelas diferentes de devotos de Louis y lectores de Louis. Uno ha sido dirigido por un hombre con el nombre de Walter Cooper que durante dos meses en el verano del último año de la vida de Louis sirvió como su secretario y ha servido como su editor post-emis desde hace muchos años, sacando a la luz libros de colecciones de fragmentos de varias obras de Louis y editoriales que se dejaron atrás en publicados durante la vida de Louis y así sucesivamente. La visión de Hooper de Louis en efecto como un santo Anglicon y vale la pena señalar que muy recientemente la Iglesia Anglicon, la Iglesia Episcopal en América, adoptó una fiesta anual menor en honor de CS Louis que es tan cerca de hecho como la Iglesia Anglicon viene en estos días a declarar algo un santo. Así que Hooper y sus seguidores no están solos en su opinión del valor moral de las obras de Louis y presumiblemente de la vida. Por otro lado, ya hablé del profundo afecto que las obras apologéticas de Louis han engendrado entre los cristianos conservadores y, de hecho, el hermano de Louis que vivió con él la mayor parte de su vida y que lo sobrevivió, conoció en 1966 a un tipo llamado Clyde S. Kirby de Wheaton College en Wheaton, Illinois. Wheaton College es una universidad evangélica líder en los Estados Unidos, una universidad cristiana conservadora y Kirby impresionó a Warner Louis, el hermano mayor de Louis lo suficiente como para que Warner Louis difamará a Wheaton. Donde ahora forman la pieza central de una colección en el Centro Marion E. Wade en Wheaton, que de hecho tiene incluso uno de los dos candidatos como el armario original del león, la bruja y el armario. Y por eso me dicen, si vas a Wheaton, puedes mirar la entrada original a Narnia como Louis lo caracteriza en su esplendor de Woody. Esas obras apologéticas de nuevo han demostrado ser enormemente influyentes. Sólo las obras de ficción son mucho así. Las obras académicas de Louis, creo, están infravaloradas en parte debido a la prominencia de sus obras de ficción y aún más sus obras evangélicas. En los días de Louis y en la actualidad, el mundo académico es abrumadoramente secular y a menudo agresivamente secular. Los compromisos manifiestos de Louis no le hicieron ningún servicio profesional. De hecho, impidieron su carrera profesional y han hecho sus trabajos académicos. No hay servicio profesional. Pienso muy fuertemente que son subestimados y subestimados. Son muy, muy buenos. Por mi dinero, él era el mejor medievalista del siglo 20. Hay otros que estaban cerca. No quiero sugerir otra cosa, pero su aprendizaje es simplemente deslumbrante. Uno de sus colegas en Inglaterra como profesor y un hombre no mucho en simpatía con Louis lo llamó el hombre de mejor grado en Inglaterra y debe haber sido. Sabía que esto es asombroso. Para cuando estaba fuera de su adolescencia, sabía griego y latín culto bastante muerto y también francés italiano y alemán bastante bien. Más tarde pasó a aprender inglés antiguo y culto muerto en inglés medio, estudió islandés antiguo. Era un hombre que leía todo lo que podía leer en el original que sabía sus cosas. Su primer trabajo académico fue llamado la alegoría del amor y para mí es tal vez el más declarado de sus obras. Aunque todavía es muy valioso. Salió en 1936 y sigue siendo tan influyente como cualquier estudio del amor cortesano. Ese es el amor entre las noches y las damas. Algunas personas piensan que su mejor trabajo y esto todavía está muy impreso como es de hecho la alegoría del amor y mucho en uso es un prefacio al paraíso perdido. Donde entre otras cosas interesantes introduce la distinción entre las epopeyas orales primarias como Homero y las epopeyas escritas secundarias como Virgil un paraíso perdido que es un lugar común de crítica hasta el día de hoy. Después de eso fue encargado de escribir el tercer volumen en la historia de Oxford de la literatura inglesa y tiene el título bastante prohibido de la literatura inglesa en el siglo XVI excluyendo a Brahma o como se podría decir Shakespeare sin Shakespeare. Y no es mucho leído y de alguna manera el más prohibitivo y el más obviamente aprendido de sus libros, pero vamos a echar un vistazo a ella en nuestra conferencia final hay algunas cosas fantásticas en ella y ningún trabajo demuestra más profundamente lo muy bien aprendido Lewis fue. Su mejor trabajo y tal vez su mejor trabajo de todos sin duda su mejor trabajo académico en mi opinión se llama la imagen desechada una introducción a la literatura medieval y renacentista que salió en 1964. Es un trabajo muy tarde en su vida. Tuve una obra de su otoño por así decirlo. Es tranquilo, genealógico, maduro, inmensamente aprendido, pero escribe con perfecto gusto, perfecta percepción crítica y con el más ligero de los toques. Y en cierto modo si usted lee cuidadosamente todo lo que alguna vez dijo académicamente en términos de ficción y aunque con el más ligero de los toques apologéticamente está en ese libro. Por supuesto, la gente medieval y renacentista que está escribiendo sobre lo que él creía. Antes de seguir adelante permítanme tomar un momento aquí para esbozar el resto del curso. En una conferencia después de esto vamos a echar un vistazo a la propia historia de vida de Lewis y sus tiempos. Luego dedicaremos las siguientes tres conferencias a su trilogía espacial, Paralandra fuera del planeta silencioso y esa fuerza horrible. Dedicaremos seis conferencias a las crónicas de Marnia que son después de todo sus obras de ficción más conocidas y más queridas y luego terminaremos con una conferencia sobre su última novela hasta que tengamos rostros. Otra conferencia sobre sus obras apologéticas, sus obras en defensa de la creencia cristiana y las estrategias que emplea para escribirlas. Y finalmente vamos a echar un vistazo a sus obras académicas. Pero por ahora en nuestra próxima conferencia vamos a echar un vistazo a la vida de CS Lewis y a las diversas circunstancias que ayudan a dar a esa vida la forma que tiene. Después de escuchar la conferencia un estudiante planteó esta pregunta al profesor Shad. ¿Puede usted entrenarse para encontrar la alegría? Escuchemos la respuesta del profesor. No creo que Lewis diría que usted podría entrenarse a la alegría y él dice muy explícitamente que los esfuerzos conscientes para buscar la alegría como tal son mal concebidos. Ellos están haciendo un Dios de lo que debe ser un camino hacia Dios o un reflejo de Dios para decirlo de esa manera. Usted no puede buscar experiencia religiosa. Usted sólo puede tratar de abrirse a sí mismo y hacer lo que se supone que debe. Así que usted está siempre en cierto sentido sorprendido por la alegría. Es entre otras cosas que creo que él discutiría desde una perspectiva teológica, una manifestación de la gracia. Pero la gracia en virtud de la palabra Grasia en latín es algo que se obtiene de forma gratuita. Es un regalo. No se puede forzar su camino en él. Y de hecho, escribe en su autobiografía Lewis hace que cuando era más joven trató de tipo de forzarse a sí mismo en la alegría y simplemente no funciona. Sucede cuando usted está mirando no a la sensación, pero lo que yace más allá. Esto termina como a uno.",
            "qa": [
                {
                    "question": "¿Cuál es el nombre del curso que los libros grabados se complacen en presentar?",
                    "answer": "Serie de estudiosos modernos",
                    "type": "short"
                },
                {
                    "question": "¿Cuál es el nombre del curso que se centra en CS Lewis?",
                    "answer": "Profesor Shud",
                    "type": "short"
                },
                {
                    "question": "¿Cuál es la mayor habilidad de Lewis?",
                    "answer": "evoca lo que él llama alegría",
                    "type": "short"
                },
                {
                    "question": "¿Qué es lo más importante en la vida para Lewis?",
                    "answer": "alegría",
                    "type": "short"
                },
                {
                    "question": "¿Quién fue uno de los autores favoritos de Lewis?",
                    "answer": "Dante",
                    "type": "short"
                },
                {
                    "question": "¿Qué asaltó Lewis por el cielo del norte?",
                    "answer": "a más allá",
                    "type": "short"
                },
                {
                    "question": "¿Cuál es la acción y el comercio de Lewis?",
                    "answer": "el otro mundo",
                    "type": "short"
                }
            ],
            "notes": "- Las Crónicas de Narnia es una serie de libros infantiles que exploran las complicadas luchas espirituales de la fe . - Profesor Timothy Schutt ha enseñado en el Colegio de Kenia desde 1986 . - Obtuvo su licenciatura en Literatura Inglesa en Yale, y su doctorado en literatura medieval y la historia de las ideas . - CS Lewis es un autor muy admirado y bien amado, a los que les gustan las obras de CS Lewis tienden a gustarle mucho, y a gustarle mucho. - Desde su muerte en 1963, curiosamente, su crecimiento progresivamente más popular y más influyente, y sus libros venden mejor ahora de lo que nunca han hecho. - El talento central de Lewis es una habilidad para evocar la alegría, su mayor capacidad es evocar lo que él llama alegría. - Esta alegría es una clave a lo largo de todas sus obras de ficción, y de hecho a través de sus obras apologéticas también. - Dudo que Lewis diga que cualquiera que la haya probado alguna vez la intercambiaría por todos los placeres del mundo. - Lewis dice alegre que la define como la más dulce y la mejor de todas las sensaciones, pero es una especie de anhelo, casi una especie de dolor. - El nombre de la joven en la vida real era mejor cada día, importante no una Beatrice, portadora de bendiciones, como su nombre significa. - Lewis fue asaltado por el cielo del norte, por la visión de amplio, brillante, espacio vacío. - Es una especie de dolor insatisfactorio para un más allá que está allí y no está allí, que para Lewis fue asaltado. - Le sorprendió la presencia de la alegría en su vida, y la importancia de la alegría. - Lewis es sobre todo el poeta, por así decirlo, del otro mundo. - Esa es su acción y comercio. - Eso es lo que le interesa. - El otro mundo es una manera de conocer el mundo real, el mundo que de hecho vivimos en este mundo. - Para Lewis, en una especie de riqueza, profundidad, complejidad y plenitud que no podemos conocer por medio de un trabajo ordinario al día. - Dante, poeta Gawain que va al castillo de Sabrina Salacca que va en Burrell a una visión del cielo, esas personas eran sus parientes espirituales. - Dice en ella se enamoró de la idea del otoño y fue la fuente de alegría para él. - Hay dentro de nosotros todo tipo de programas neurológicos cableados para ordenar y organizar la experiencia que operan casi completamente inconscientemente. - Y luego pensar en la memoria todo tipo de cosas que no son conscientes a un momento dado que puede descansar fuera de la conciencia durante años y de repente se presentan.",
            "quiz": [
                {
                    "id": 1,
                    "type": "short",
                    "question": "What is the name of the course that recorded books is pleased to present?",
                    "correct": "modern scholar series",
                    "explanation": "Verified: modern scholar series"
                },
                {
                    "id": 2,
                    "type": "mcq",
                    "question": "What is the name of the course that focuses on CS Lewis?",
                    "options": [
                        "Professor Shud",
                        "really",
                        "writer",
                        "oddly"
                    ],
                    "correct": "Professor Shud",
                    "explanation": "Key Term: Professor Shud"
                },
                {
                    "id": 3,
                    "type": "short",
                    "question": "What is Lewis' greatest ability?",
                    "correct": "evoke what he calls joy",
                    "explanation": "Verified: evoke what he calls joy"
                },
                {
                    "id": 4,
                    "type": "mcq",
                    "question": "What is the most important thing in life for Lewis?",
                    "options": [
                        "autobiography",
                        "joy",
                        "again",
                        "further"
                    ],
                    "correct": "joy",
                    "explanation": "Key Term: joy"
                },
                {
                    "id": 5,
                    "type": "short",
                    "question": "Who was one of Lewis' favorite authors?",
                    "correct": "Dante",
                    "explanation": "Verified: Dante"
                },
                {
                    "id": 6,
                    "type": "mcq",
                    "question": "What did Lewis mugged by the northern sky?",
                    "options": [
                        "vision",
                        "argued",
                        "a beyond",
                        "work"
                    ],
                    "correct": "a beyond",
                    "explanation": "Key Term: a beyond"
                }
            ],
            "flashcards": [
                {
                    "front": "What is the name of the course that recorded books is pleased to present?",
                    "back": "modern scholar series"
                },
                {
                    "front": "What is the name of the course that focuses on CS Lewis?",
                    "back": "Professor Shud"
                },
                {
                    "front": "What is Lewis' greatest ability?",
                    "back": "evoke what he calls joy"
                },
                {
                    "front": "What is the most important thing in life for Lewis?",
                    "back": "joy"
                },
                {
                    "front": "Who was one of Lewis' favorite authors?",
                    "back": "Dante"
                },
                {
                    "front": "What did Lewis mugged by the northern sky?",
                    "back": "a beyond"
                }
            ],
            "language": "es"
        },
        "wordCount": 4680
    },
    "9e9390ad-f4f3-42eb-b0fa-4a0a40a9abd2": {
        "status": "completed",
        "type": "youtube",
        "title": "YouTube: https://www.youtube.com/watch?...",
        "date": "2026-02-12 13:22:46",
        "language": "hi",
        "result": {
            "transcript": " I've won in welcome to Pna College and today's session is regarding the strategy for GSOC 2020-25 which is Google Summer of Code. Now we have multiple students who have gotten selected in GSOC in the past few years, both from YouTube as well as paid batches. And this is literally one of the most demanded videos on YouTube from our students, and that is why we decided to make this session. A large case session may be going to talk about a lot of different things, including what exactly is GSOC, GSOC, timeline, what is the organization that we are in the organization, how do we exactly write a proposal, what are the things which increase our chances of getting selected into GSOC, and throughout the session we'll also get to see different tips and tricks from students who have already been selected in GSOC. So the best thing that I like about Google Summer of Code is that here we don't have our branch matter, we don't have our degree, we don't have our marks, we don't have our year of college, we don't have our semester, we don't have our own matter. If we have our skills and if we are ready to put in the hard work, then we stand a good chance of getting selected into this open source program, which is run by Google from the past 19 years. So the students already know that GSOC is an open source program, in which they divide the different organizations and invite their projects, and the students invite them to contribute to their projects. And as you can see, it is around 12 weeks, and it is very similar to having an internship. GSOC is there are three different types of projects that are divided into the organizations. Small projects, medium projects and large projects. Depending upon the project size, our eyes of commitment differ, and our stipend be differ. For small projects, generally, India, the stipend is $700, for medium projects is $1500 USD and for large projects is $3,000 USD. Now this stipend is around 2.4 lakhs, which definitely catches the fancy of most students, but stipend should not be our primary objective for preparing for GSOC. Primary objective GSOC can apply to our community, and in the first step, the opportunity that it brings is a really good program to be part of. And secondly, the experience that it gives you, we get the opportunity to work in a good project with good developers around the world. So there are a few unique opportunities, which are definitely going to try to make students come and try to try. Now, before we start, there is one more message, which I will repeat every time I repeat GSOC. That Google Summer of Code is not about competition, it is about collaboration. Definitely this stipend is good, but stipend temporary hit, and the budget experience will be available. That experience is going to be very, very, very permanent. So GSOC is talking about GSOC and the primary thing that we have done is the timeline of the program. Now we can go and visit this link to view the entire timeline of GSOC. GSOC 2020-24, here is a year's timeline, we are preparing for the 2020-25. The entire timeline is the three dates that are important. The announcement of the organization. Generally, GSOC and the project that GSOC are going to participate in the project, will be in the February 25th, February 25th, so we will be able to contribute to the project that is available in the world, which we can contribute to. We have a time to understand the process of the organization, which is the process of the organization and the people who study in the past, and they try to understand the issues and network with the mentors. After that, we have the second important step, that is to submit your proposal. Proposal is that document, which is under after picking the project, we have to tell our own about it, and we have to tell what are our plans for the project that we want to do in the summer. Generally, we have to submit the proposal to the company, which is from March 12th April, and then we will have a third most important date when the contributors are announced. I want to tell you that the students are selected, and the students who work in the same way, will work in the next few days. This entire timeline, according to our preparation, we will start a lot. A lot of beginners think that, officially, if the program February can start, then we will start contributing on learning stuff in February. But majority of the students who get selected in G-Sock start their preparation very early on. Such a parallel step of starting the preparation for G-Sock, or for contribution to any kind of open source technology, is to learn something on our own first. The majority of open source projects are maintained, they do not like hand holding. They are aware that some of the people who have already done something, and they are able to contribute in an impactful way. So, basically, to contribute to our technology, we need to know better about the opportunities. So, we have already done G-Sock 25, which is the first time we have started G-Sock, so October and November are good months to start a preparation. Now, the first step in the preparation journey is to learn a programming language. Paiathan Javascript Ruby PHP Java, are one of the most popular languages that students start with. And in fact, these are languages that are majority of G-Sock and they use. But if we are interested in C-C++, Paul and G-Sock, then we can also go and learn those programming languages. Apart from this, there are students who are interested in learning of machine learning, or hardware technologies, so G-Sock and other projects that are also connected with the data science. And which are hardware. So, if we are somebody who is mainstream programming, but these are the main technologies that are interested. So, there will be something or other that we are going to do in G-Sock. So, we can contribute to them, but the important thing is that when we are programming, we are learning a lot of technology. So, our fundamental understanding is strong. We will help the G-Sock different projects in the code base. Now, if you are a beginner who still confused about which language to pick, then I personally advise you to pick up the JavaScript or Paiathan. Because this is the language that we are going to do in the majority of G-Sock projects. Now, first step is to learn how to learn the first step. So, we have to step on the second step, which is to build projects on our own. Now, we have to build a project that is important because we are understanding what is different from different products technology. And this is really fundamental. A common mistake that we commit first time, we have to commit that. That is that we have to start a syntax and create a programming language. And then directly, we are going to understand the code base and understand the code base. This is the mistake that when we are understanding the code base and when we are not able to make the project, then we have to understand the code base and understand the code base and the difficult thing. While building projects, we can start with small projects, which we are going to do in the end of the year. And we are going to increase the scale in the end of the year. Now, third and crucial step in the preparation journey is to learn about version control system. Version control system, we have to get GitHub GitHub, GitHub is very different tools and we can learn about it in the beginning. I will advise you that you start with GitHub because it is the most popular in the majority of projects. We will get this here and we have a very good resource as well. When we are saying that we need to create a control system, then it means that we need to get GitHub to understand the code base. We need to get the information about the branches and the comments that we have been given, we have been able to share the details of the details of the data. And we have to get all the information and we have to get the hands on. Regarding version control, we have already learned the code and GitHub is completely too real. If you are interested in learning, you can learn from that. And it is the majority programming languages and the community has discussed it. It has also been one shots available on this YouTube channel. Now the fourth step in the preparation journey is to have some open source contribution experience. We can directly get GitHub to get GitHub, we can pick some random organizations, some random projects and then we can start them. We can also see the previous year organizations, they can do some organizations, they can pick up some and they can work on their own organizations, but we can start them and then we can start them. And no, I am a GSO from one of your videos, what GSO, how to bracket, I was not open for contributor until next year after senior video, I learned about afterwards face, what is afterward face, how to open for the contributor. So, organizationally, public, public, in GSO website, I just go through their past contributors, how many contribute, built on their two, what were the previous project and what were the text set. So after that, the organization aligned to my text set, I selected those and I went through their issue, I studied their project structure and repository, then I started my contribution. If you want to know about previous year organizations, then we can go to this link, depending upon different technologies, which are different different organizations, I will come to you, I will participate in the last year, now we are going to randomly open a organization, and we can visit their project. Now let's take an example of this project by FOS Asia. Now, our project is actually something we are going to do, if we are going to contribute to the first time, then we are going to contribute to all the organizations, when we go to the issues, then we have some level attached to each issue. And the levels are different, some organizations are specific, in particular, levels that are connected to the beginners, and some issues that are specifically connected to the beginners, like for example, on this project, there is a label called Good First issue and a label called Newbie Friendly. Basically, the issues with the same level are attached to the people who start the beginners with the issues with the beginners. So if we are going to start the first time, we can open the organization's project, and the people who can understand the rules of the beginners, they can do the first thing to do, long term, these issues are matter, but the people who want to increase the chances of selection, we have to target the issues, basically, if we can use any feature, or any enhancement, or something else, but basically, we can do the same thing, and we have to do the same thing, and to organize the organizations, and to increase the amount of the beginners, because we are creating their impact which will be so much better, we are not going to be able to get our chances of getting selected. So, as a beginner, we are not going to be able to get our chances of getting selected, but we are not going to be able to get our chances of getting selected, but we are not going to be able to get our chances of getting selected, but we are not going to be able to get our chances of getting selected, but we are not going to be able to get our chances of getting selected, but we are not going to be able to get our chances of getting selected, but we are not going to be able to get our chances of getting selected, but we are not going to be able to get our chances of getting selected, but we are not going to be able to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are not going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are not going to think that containers are responsible for solving all of our bigger levels, so engage in meaningful conversation, respect the containers as well as your time. So this is the important steps, which is hopefully if we have done so many things, then in majority cases, 80% effort has already been done, and now if we have done a lot of contributions, then we have to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected, and we are going to get our chances of getting selected,",
            "qa": [
                {
                    "question": "जीएसओसी 2020-25 के लिए क्या रणनीति है?",
                    "answer": "कोड का Google समर",
                    "type": "short"
                },
                {
                    "question": "जीएसओसी के लिए वजीफा क्या है?",
                    "answer": "2.4 लाख",
                    "type": "short"
                },
                {
                    "question": "कंपनी को प्रस्ताव के लिए तीसरी सबसे महत्वपूर्ण तारीख कौन सी है?",
                    "answer": "मार्च 12 अप्रैल",
                    "type": "short"
                },
                {
                    "question": "पहला कदम सीखने में पहला कदम क्या है?",
                    "answer": "यह जानने के लिए कि पहला कदम कैसे सीखा जाए",
                    "type": "short"
                },
                {
                    "question": "तैयारी यात्रा का चौथा चरण क्या है?",
                    "answer": "कुछ मुक्त स्रोत योगदान अनुभव प्राप्त करने के लिए",
                    "type": "short"
                },
                {
                    "question": "गुड फ़र्स्ट अंक का लेबल क्या है?",
                    "answer": "नौसिखिया मिलनसार",
                    "type": "short"
                },
                {
                    "question": "न्यूबी फ्रेंडली का लेबल क्या है?",
                    "answer": "अच्छा पहला अंक",
                    "type": "short"
                }
            ],
            "notes": "- यह हमारे छात्रों द्वारा YouTube पर सबसे अधिक मांग वाले वीडियो में से एक है, और इसीलिए हमने इस सत्र को बनाने का निर्णय लिया है।\n- Google Summer of Code एक ओपन सोर्स प्रोग्राम है, जिसमें वे विभिन्न संगठनों को विभाजित करते हैं और अपनी परियोजनाओं को आमंत्रित करते हैं, और छात्र उन्हें अपनी परियोजनाओं में योगदान देने के लिए आमंत्रित करते हैं।\n- छोटी परियोजनाओं के लिए, आम तौर पर, भारत में, वजीफा $700 है, मध्यम परियोजनाओं के लिए $1500 USD है और बड़ी परियोजनाओं के लिए है।\n- Google Summer of Code प्रतिस्पर्धा के बारे में नहीं है, यह सहयोग के बारे में है।\n- कार्यक्रम का हिस्सा बनने के लिए यह वास्तव में एक अच्छा कार्यक्रम है, और यह आपको जो अनुभव देता है, उससे हमें दुनिया भर के अच्छे डेवलपर्स के साथ एक अच्छे प्रोजेक्ट में काम करने का अवसर मिलता है।\n- कुछ अनूठे अवसर हैं, जो निश्चित रूप से छात्रों को आने और प्रयास करने के लिए प्रेरित करेंगे।\n- जी-सॉक में चयनित होने वाले अधिकांश छात्र अपनी तैयारी बहुत पहले से ही शुरू कर देते हैं।\n- तैयारी यात्रा में पहला कदम एक प्रोग्रामिंग भाषा सीखना है।\n- ऐसे छात्र हैं जो मशीन लर्निंग, या हार्डवेयर प्रौद्योगिकियों को सीखने में रुचि रखते हैं।\n- एक सामान्य गलती जो हम पहली बार करते हैं, वही हमें करनी पड़ती है।\n- हमें एक सिंटैक्स शुरू करना होगा और एक प्रोग्रामिंग भाषा बनानी होगी।\n- यही वह भाषा है जो हम अधिकांश जी-सॉक परियोजनाओं में करने जा रहे हैं।\n- तो, ​​हम उनमें योगदान दे सकते हैं, लेकिन महत्वपूर्ण बात यह है कि जब हम प्रोग्रामिंग कर रहे होते हैं, तो हम बहुत सारी तकनीक सीख रहे होते हैं।\n- हम सीधे GitHub प्राप्त कर सकते हैं GitHub प्राप्त करने के लिए, हम कुछ यादृच्छिक संगठनों, कुछ यादृच्छिक परियोजनाओं को चुन सकते हैं और फिर हम उन्हें शुरू कर सकते हैं।\n- हम पिछले वर्ष के संगठन भी देख सकते हैं, वे कुछ संगठन कर सकते हैं।\n- और नहीं, मैं आपके एक वीडियो से जीएसओ हूं, जीएसओ क्या है, ब्रैकेट कैसे बनाएं, वरिष्ठ वीडियो के बाद अगले साल तक मैं योगदानकर्ता के लिए कैसे खुला नहीं था, मुझे बाद के चेहरे के बारे में पता चला।\n- कुछ संगठन विशिष्ट, विशेष रूप से, स्तर होते हैं जो शुरुआती लोगों से जुड़े होते हैं।\n- जो लोग चयन की संभावना बढ़ाना चाहते हैं, हमें मुद्दों को लक्षित करना होगा, मूल रूप से, यदि हम किसी सुविधा, या किसी संवर्द्धन का उपयोग कर सकते हैं, लेकिन मूल रूप से, हम वही काम कर सकते हैं।\n- एक नौसिखिया के रूप में, हमें चयनित होने का मौका नहीं मिल पाएगा, लेकिन हमें चयनित होने का मौका नहीं मिलेगा।\n- तो, ​​एक शुरुआत के रूप में हम चयन पाने का मौका पाने में असमर्थ होंगे।\n- हम चयनित होने के तरीके के बारे में जानने के लिए सही जगह पर नहीं जाएंगे और हमारा चयन नहीं होगा।\n- हमें चयनित होने के अपने मौके मिलने वाले हैं, और हमें अपने मौके मिलने वाले हैं।\n- हमें चयनित होने का मौका मिलेगा।\n- हमें उन लोगों से ढेर सारा योगदान मिलने की उम्मीद है जिन्होंने बहुत सारे काम किए हैं जो पहले ही किए जा चुके हैं।\n- हमें भी चयनित होने का मौका मिल सकेगा।",
            "quiz": [
                {
                    "id": 1,
                    "type": "short",
                    "question": "What is the strategy for GSOC 2020-25?",
                    "correct": "Google Summer of Code",
                    "explanation": "Verified: Google Summer of Code"
                },
                {
                    "id": 2,
                    "type": "mcq",
                    "question": "What is the stipend for GSOC?",
                    "options": [
                        "participate",
                        "world",
                        "2.4 lakhs",
                        "stipend"
                    ],
                    "correct": "2.4 lakhs",
                    "explanation": "Key Term: 2.4 lakhs"
                },
                {
                    "id": 3,
                    "type": "short",
                    "question": "What is the third most important date for the proposal to the company?",
                    "correct": "March 12th April",
                    "explanation": "Verified: March 12th April"
                },
                {
                    "id": 4,
                    "type": "mcq",
                    "question": "What is the first step in learning the first step?",
                    "options": [
                        "beginner",
                        "commit",
                        "beginning",
                        "to learn how to learn the first step"
                    ],
                    "correct": "to learn how to learn the first step",
                    "explanation": "Key Term: to learn how to learn the first step"
                },
                {
                    "id": 5,
                    "type": "short",
                    "question": "What is the fourth step in the preparation journey?",
                    "correct": "to have some open source contribution experience",
                    "explanation": "Verified: to have some open source contribution experience"
                }
            ],
            "flashcards": [
                {
                    "front": "What is the strategy for GSOC 2020-25?",
                    "back": "Google Summer of Code"
                },
                {
                    "front": "What is the stipend for GSOC?",
                    "back": "2.4 lakhs"
                },
                {
                    "front": "What is the third most important date for the proposal to the company?",
                    "back": "March 12th April"
                },
                {
                    "front": "What is the first step in learning the first step?",
                    "back": "to learn how to learn the first step"
                },
                {
                    "front": "What is the fourth step in the preparation journey?",
                    "back": "to have some open source contribution experience"
                }
            ],
            "language": "hi"
        },
        "wordCount": 5163
    }
}